
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Товары.Записывать = Истина;
	Движения.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходныйОрдерТовары.Номенклатура,
	|	СУММА(ПриходныйОрдерТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдер.Товары КАК ПриходныйОрдерТовары
	|ГДЕ
	|	ПриходныйОрдерТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерТовары.Номенклатура,
	|	ПриходныйОрдерТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезЗапроса = Запрос.Выполнить();
	Выборка = РезЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = Движения.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Период = Дата;
		
	КонецЦикла;

	// FIXME 

	
КонецПроцедуры
