
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)

	ТоварыПриИзмененииНаСервере();

КонецПроцедуры


&НаСервере
Процедура ТоварыПриИзмененииНаСервере()
	
	ТоварыПриИзмененииНаСервере_Часть2();	
	
КонецПроцедуры

&НаСервере
Процедура ТоварыПриИзмененииНаСервере_Часть2()
	
	ДатаОбъекта = Объект.Дата;
	ДатаДокумента = ДатаОбъекта;
	ДатаДокумента1 = ДатаОбъекта;	
	
	
КонецПроцедуры

Функция имяФункции(Параметры)
	Сообщить("Возврат");
	
	возврат Неопределено;
КонецФункции

